---
kind: other
id: Methods.T:Autodesk.Revit.UI.PreviewControl
source: html/83721fbf-1f10-5939-2e1c-05e0f66cea56.htm
---
# PreviewControl Methods

This method is called if the user explicitly disposes of the
object (by calling the Dispose method in other managed languages,
or the destructor in C++).